In [1]:
# Dependencies and Setup
# SQL Alchemy
from sqlalchemy import create_engine

# Pandas
import pandas as pd

# Matplotlib
import matplotlib.pyplot as plt

# NumPy
import numpy as np

In [2]:
# Create Engine for census data
#census_database_path = "../Resources/Census_Data.sqlite"
engine = create_engine("postgresql://postgres:postgresql@localhost:5432/sqlhomeworkbadou")
conn = engine.connect()

In [3]:
# Query All Records in the the City Table
departments_data = pd.read_sql("SELECT * FROM departments", conn)
departments_data

  dept_no           dept_name
0    d001           Marketing
1    d002             Finance
2    d003     Human Resources
3    d004          Production
4    d005         Development
5    d006  Quality Management
6    d007               Sales
7    d008            Research
8    d009    Customer Service

In [4]:
# Query All Records in the the City Table
dept_emp_data = pd.read_sql("SELECT * FROM dept_emp", conn)
dept_emp_data.head()

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01

In [5]:
# Query All Records in the the City Table
dept_manager_data = pd.read_sql("SELECT * FROM dept_manager", conn)
dept_manager_data.head()

  dept_no  emp_no   from_date     to_date
0    d001  110022  1985-01-01  1991-10-01
1    d001  110039  1991-10-01  9999-01-01
2    d002  110085  1985-01-01  1989-12-17
3    d002  110114  1989-12-17  9999-01-01
4    d003  110183  1985-01-01  1992-03-21

In [6]:
# Query All Records in the the City Table
employees_data = pd.read_sql("SELECT * FROM employees", conn)
employees_data.head()

   emp_no  birth_date first_name last_name gender  hired_date
0   10001  1953-09-02     Georgi   Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2   10003  1959-12-03      Parto   Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12

In [7]:
# Query All Records in the the City Table
salaries_data = pd.read_sql("SELECT * FROM salaries", conn)
salaries_data.head()

   emp_no      salary   from_date     to_date
0   10001  $60,117.00  1986-06-26  1987-06-26
1   10002  $65,828.00  1996-08-03  1997-08-03
2   10003  $40,006.00  1995-12-03  1996-12-02
3   10004  $40,054.00  1986-12-01  1987-12-01
4   10005  $78,228.00  1989-09-12  1990-09-12

In [42]:
# Query All Records in the the City Table
titles_data = pd.read_sql("SELECT * FROM titles", conn)
titles_data.head()

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01

In [27]:
# let combined the data
combined_data=pd.merge(salaries_data, titles_data, on ="emp_no", how="inner")
combined_data.head()

,emp_no,salary,from_date_x,to_date_x,title,from_date_y,to_date_y
0,10001,"$60,117.00",1986-06-26,1987-06-26,Senior Engineer,1986-06-26,9999-01-01
1,10002,"$65,828.00",1996-08-03,1997-08-03,Staff,1996-08-03,9999-01-01
2,10003,"$40,006.00",1995-12-03,1996-12-02,Senior Engineer,1995-12-03,9999-01-01
3,10004,"$40,054.00",1986-12-01,1987-12-01,Engineer,1986-12-01,1995-12-01
4,10004,"$40,054.00",1986-12-01,1987-12-01,Senior Engineer,1995-12-01,9999-01-01

In [10]:
#title_salary=combined_data[['emp_no','salary','title']]
#title_salary

In [44]:
group_data=combined_data.groupby(['title']).mean()
group_data.head()

                           emp_no
title
Assistant Engineer  251495.398533
Engineer            252943.159987
Manager             110780.833333
Senior Engineer     253034.375949
Senior Staff        253423.367183

In [48]:
group_data2=combined_data.groupby(['salary']).mean()
group_data2

               emp_no
salary
$100,000.00  483067.0
$100,006.00  402349.0
$100,022.00  248927.0
$100,025.00  281475.0
$100,026.00  410411.0
$100,027.00  206029.0
$100,030.00   62709.0
$100,031.00  404261.0
$100,052.00  276196.0
$100,053.00  489872.0
$100,058.00  434468.0
$100,064.00  486891.0
$100,068.00  231420.0
$100,072.00   57996.0
$100,079.00  490267.0
$100,097.00  285298.0
$100,102.00   35069.0
$100,107.00  445354.0
$100,118.00  452633.0
$100,122.00  261213.0
$100,133.00  359224.5
$100,139.00   93639.0
$100,148.00  249631.0
$100,150.00  210269.0
$100,154.00   28373.0
$100,158.00  107710.0
$100,162.00  263041.0
$100,163.00  472438.0
$100,164.00   40230.0
$100,167.00  280525.0
...               ...
$99,849.00   212652.0
$99,851.00   425763.0
$99,852.00   455475.0
$99,853.00    66181.0
$99,860.00   407573.0
$99,862.00    43668.0
$99,867.00    18581.0
$99,876.00   230361.0
$99,878.00   101914.0
$99,881.00   279372.0
$99,888.00   269570.0
$99,897.00    61601.0
$99,903.00   476850.0
$99,904.00   490610.0
$99,918.00   435343.0
$99,927.00    87374.0
$99,937.00   242204.0
$99,939.00   420951.0
$99,948.00    31595.0
$99,959.00   415886.0
$99,973.00   282731.0
$99,976.00    70087.0
$99,977.00   498461.0
$99,978.00   278540.0
$99,981.00    31499.0
$99,984.00   205875.0
$99,988.00    31607.0
$99,990.00   425641.0
$99,993.00   213379.0
$99,999.00   235675.0

[50355 rows x 1 columns]